<template>
    <article class="row">
      <div class="col s12 l12">
        <h1 class="center">Тестовый Страниц</h1>
          <div class="article_attr valign-wrapper">
            <img src="../assets/tmp_dev/avatar2.jpg" alt="" class="circle avatar">
            <span class="author">Автор Пупкина</span>
            <p class="pubdate"><em>23.02.2020</em></p>
            <i class="material-icons">comment</i> <span class="count-comments">23</span>
          </div>
          <img src="../assets/poker_hall.jpg" alt="" class="responsive-img">
          <p>
            Я заебся уже по несколько раз одно и тоже повторять. Больше предупреждать никого не буду. Может хоть так начнет к людям доходить что надо нормально общаться, а не клоунить и матом отвечать...          </p>
          <p>Что касается темперамента и способности к коммуникации, то есть одна авторская методика. В ней автор отрицает классическое деление на типы темперамента (холерик, сангвиник, флегматик, меланхолик) и классические психотипы (Экстраверт, интроверт, амбивент). Поскольку все эти деления весьма условны. Например: на работе человек может проявлять черты холерика и экстраверта, а дома он флегматик-интроверт.</p>
            <p>

Вкратце опишу его методику вместо, без оценочных суждений. Называть автора тоже не буду, чтобы не сочли за рекламу</p>
<p>
Итак. Автор вводит иные понятия основанные на двух основных критериях: 1. IQ  2. Характер</p>
<p>
Человек с высоким IQ и слабым характером, рационален, но пассивен. (Рационально мыслящий тормоз). Все знает, все понимает, но ничего не делает</p>
<p>Человек с Сильным характером и Средним или  низким IQ, эмоционален и импульсивен.  (Эмоциональная обезьянка) (Фантазер)
Человек со слабым характером и низким (или средним, но со сниженной мотивацией) IQ, (Уставший пофигист), (Еж исполнитель). Еж, потому что, "пока не пнешь, не полетит"</p>
<p>Человек с сильным характером и средним IQ,  (это боец, готовый ринуться в атаку)</p>
<p>Ну и редчайшее сочетание: высокий IQ и сильный характер - Это от природы одаренный человек, (которому все само удается)</p>
<p>
Базовые характеристики: IQ и характер, являются врожденными (Ну или приобретаются в самые ранние годы, так что в сознательном возрасте корректировке практически не подлежат, потому приравниваются к врожденным). При этом. В сознательном возрасте, корректировка возможна, при условии благоприятной среды для развития и осознанной практике. (Например: регулярные физкультурой, чтение умных книжек, и отказ от ряда вредных привычек, и здоровый сон способствуют повышению IQ. В то время как алкоголь, малоподвижный образ жизни и регулярный недосып  снижают этот показатель. То же касается характера: регулярное решение новых задач, осознанное формирование привычек и самоконтроль, укрепляют характер.) Но при этом перепрыгнуть свою биологию человек не способен. (Коррекция возможна в пределах 20% в обе стороны)</p>
<p>
Исходя из того, что человек существо живое, и что он может быть не выспавшимся (или наоборот, хорошо отдохнувшим), сосредоточенным (или наоборот эмоционально нестабильным). ТО ни один из перечисленных психотипов не является постоянным. (Иначе это уже клиника). Человек может быть Бойцом в одной ситуации (когда знает что делать, и готов действовать), или Тормозом, (когда пытается разобраться в ситуации, и не готов быстро принять решение). Или вообще "Ежом исполнителем" (Если устал, и чего делать не понятно, и вообще пошло оно все...). Ну или пребывать в эйфории от хорошей новости, и фантазировать, на тему (Вместо рациональной оценки ситуации)</p>
<p>
При этом ведущий психотип все же, есть (это зависит от врожденных характеристик и образа жизни). И зная методику воздействия на каждый психотип, (Боец, Фантазер, Еж, Тормоз), можно, воздействовать на себя, и на окружение</p>
<p>
Все выше описанное я привел в пример весьма условно. И все же лично мне это кажется не лишено смысла. И как мне кажется, все это неплохо накладывается на Джедайские техники, поскольку все люди разные, и кому-то подходит одно, а кому-то другое. А как понять кому что подходит? Я предполагаю что техники, описанные в книге, можно разделить по психотипам (или темпераментам, если кому-то так больше нравится), и утверждать что: людям с определенным психотипом (темпераментом), хорошо зайдут вполне определенные методики.</p>
          <h4 class="right-line">Комментарии</h4>
          <ul class="comments">
            <li>
                  <i></i>
                  <div class="post-attr card">
                  <img src="../assets/tmp_dev/avatar2.jpg" alt="" class="circle avatar">
                  <div class="post-user">BOSS</div>
                  <time class="post-date" datetime="2020-03-07T19:00">07.03.2020
                    <span>19:00</span></time>
                  </div>
                  <div>
                    <p>Кто знает проблеммы не будет есле жена себе ак делает на пати и играть с моего компа будет?</p>
                  </div>
                </li>
            <li>
              <i></i>
              <ul class="comments">
                <li>
                  <i></i>
                  <div class="post-attr card">
                  <img src="../assets/tmp_dev/avatar2.jpg" alt="" class="circle avatar">
                  <div class="post-user">Вася Пупкинc-Семичастныонезависимый</div>
                  <time class="post-date" datetime="2020-03-07T19:00">07.03.2020
                    <span>19:00</span></time>
                  </div>
                  <div>
                    <p>Последний столик на сегодня Итог пока -67 по БР из за вчера он особо не вырвался. Кстати я в чера 14 вылетел в 5.5 делей марафон. А так вот 11 баунти остался</p>
                  </div>
                </li>
                <li>
                  <i></i>
                  <div class="post-attr card">
                  <img src="../assets/tmp_dev/avatar2.jpg" alt="" class="circle avatar">
                  <div class="post-user">✵V✵E✵💲✵Ë✵L✵I✵Y✵ ✵V✵A✵N✵O✵</div>
                  <time class="post-date" datetime="2020-03-07T19:00">07.03.2020
                    <span>19:00</span></time>
                  </div>
                  <div>
                    <p>Последний столик на сегодня Итог пока -67 по БР из за вчера он особо не вырвался. Кстати я в чера 14 вылетел в 5.5 делей марафон. А так вот 11 баунти остался</p>
                  </div>
                </li>
              </ul>
            </li>
            <li>
                  <i></i>
                  <div class="post-attr card">
                  <img src="../assets/tmp_dev/avatar2.jpg" alt="" class="circle avatar">
                  <div class="post-user">Вячеслав Петрович Космодемьянский</div>
                  <time class="post-date" datetime="2020-03-07T19:00">07.03.2020
                    <span>19:00</span></time>
                  </div>
                  <div>
                    <p>Последний столик на сегодня Итог пока -67 по БР из за вчера он особо не вырвался. Кстати я в чера 14 вылетел в 5.5 делей марафон. А так вот 11 баунти остался</p>
                  </div>
                </li>
          </ul>


      </div>
    </article>
</template>

<script>
  export default {}
</script>

<style lang="sass">
article
  font-size: 16px
  text-align: left
  .article_attr
    margin-bottom: 24px
    .author
      margin-left: 12px
      font-weight: 600
    .avatar
      height: 42px
      width: 42px
      margin: 0
    p
      display: inline-block
      margin: 0 12px
    .count-comments
      margin-left: 3px

  > img
    margin: 0 auto
    display: block
  .right-line
    position: relative
    z-index: 1
    overflow: hidden
    margin: 30px 0
    &:after
      position: absolute
      top: 55%
      overflow: hidden
      width: 100%
      height: 1px
      content: '\a0'
      border-left: solid 20px #f5f5f5
      background-color: #ddd
.comments
  border-left: 1px solid #aaa
  margin: 0 0 0 70px
  li
    // display: flex
    position: relative
    padding: 0 0 12px 12px
    i
      content: '33'
      position: absolute
      top: 20px
      left: -5.5px
      width: 10px
      height: 10px
      border-radius: 50%
      border: 2px solid gold
      background-color: #ffa726
    img
      max-width: 58px
      position: absolute
      top: 20px
      left: -80px
    .post-attr
      // position: absolute
      display: flex
      justify-content: space-between
      width: 100%
      padding: 8px
      margin: 12px 0
      // left: -130px
      // top: 26px
      // color: red
      // text-align: right
      .post-user
        color: #ffa726
        font-weight: 600
        overflow-wrap: anywhere
      time
        color: #999
        font-style: italic
        &.post-date
        &.post-time
    .card
      // padding: 0 6px
      // margin: 10px
@media only screen and (max-width: 460px){
.comments
  margin: 0
  li
    .post-attr
      flex-wrap: wrap
      flex-direction: column
      justify-content: flex-end
      padding-left: 60px
      text-align: right
      img
        top: 4px
        left: 4px
        width: 58px
        height: 58px}
      // time
      //   // flex-grow: 1
      //   text-align: right}
</style>